недостатки
1. Относительно мало хостингов (по сравнению с тем же PHP)
2. Ресурсоемкий/производительность
3. Документация (перекликается с достоинством п.3, т.е. вроде как средства есть, 
   но это не задокументированно. Проблема в последний год-два уже значительно 
   теряет свою актуальность )
4. Высокий порог вхождения. Перекликается с предыдущим пунктом: несмотря на 
   великолепный синтаксис и кучу плющек, начать программировать на руби 
   достаточно сложно.

достоинства
1. ооп
2. синтаксис
3. продвинутые методы (не требуется изобретать велосипед такие как нахождения 
   уникальных записей в масиве и прочее, все реализованно стандартными 
   средствами)
4. кроссплатформенность (с большой оговоркой, что касается чистого руби, а если 
   нужны рельсы на винде то начинается танец с элементами экзорцизма)
5. постоянно развивается, комьююнити (это уже плюс, хотя года 4 назад все еще 
   было печально).